In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Pandas
DataFrame (Excel -> Table)
Series (Excel -> Column)

In [3]:
s1 = pd.Series([1,2,3,4]) # list
s2 = pd.Series((1,2,3,4)) # Tuple
s2 = pd.Series((1,2,3,4), index=['A','B','C','D'])
s2 = pd.Series((1,2,3,4), index=['A','B','C','D'], name="CNIC")
s2.index.name="ID"
print(s1, s2, sep="\n\n")

0    1
1    2
2    3
3    4
dtype: int64

ID
A    1
B    2
C    3
D    4
Name: CNIC, dtype: int64

In [4]:
d1 = {"A":1,
     "B":2,
     "C":3,
     "D":4}
s3 = pd.Series(d1) # Dictionary
s3

A    1
B    2
C    3
D    4
dtype: int64

# DataFrame

In [5]:
# Here we have just created a list of lists
#id, name , course, fee
data = [[1, 'Ali','A.I',1500],
       [2, 'Asif','A.I',1500],
       [3, 'Hamza','A.I',3000],
       [4, 'Kashif','AIOT',1500],
       [5, 'Ali','A.I',3000]]
data

[[1, 'Ali', 'A.I', 1500],
 [2, 'Asif', 'A.I', 1500],
 [3, 'Hamza', 'A.I', 3000],
 [4, 'Kashif', 'AIOT', 1500],
 [5, 'Ali', 'A.I', 3000]]

In [10]:
df1 = pd.DataFrame(data)
df1

   0       1     2     3
0  1     Ali   A.I  1500
1  2    Asif   A.I  1500
2  3   Hamza   A.I  3000
3  4  Kashif  AIOT  1500
4  5     Ali   A.I  3000

In [11]:
df1 = pd.DataFrame(data, columns=["ID","Name","Course","Fee"], index=range(1,6))
df1

   ID    Name Course   Fee
1   1     Ali    A.I  1500
2   2    Asif    A.I  1500
3   3   Hamza    A.I  3000
4   4  Kashif   AIOT  1500
5   5     Ali    A.I  3000

# list of tuple

In [12]:
#id, name , course, fee
data = [(1, 'Ali','A.I',1500),
       (2, 'Asif','A.I',1500),
       (3, 'Hamza','A.I',3000),
       (4, 'Kashif','AIOT',1500),
       (5, 'Ali','A.I',3000)]
df1 = pd.DataFrame(data, columns=["ID","Name","Course","Fee"], index=range(101,106))
df1

     ID    Name Course   Fee
101   1     Ali    A.I  1500
102   2    Asif    A.I  1500
103   3   Hamza    A.I  3000
104   4  Kashif   AIOT  1500
105   5     Ali    A.I  3000

# Dictionar of list

In [13]:
d1 = {"ID": [1,2,3,4,5,6],
     "Name":['Ali',"Hamza","Junaid","Asif",'Ali',"Kashif"],
     'Course':['AIOT',"CNC","AI",'AIOT',"CNC","AI"],
     'Fee':[1000,1000,1200, 2000,1500,2000]}
d1

{'Course': ['AIOT', 'CNC', 'AI', 'AIOT', 'CNC', 'AI'],
 'Fee': [1000, 1000, 1200, 2000, 1500, 2000],
 'ID': [1, 2, 3, 4, 5, 6],
 'Name': ['Ali', 'Hamza', 'Junaid', 'Asif', 'Ali', 'Kashif']}

In [14]:
df1 = pd.DataFrame(d1, index=['A','B','C','D','E','F'])
df1

  Course   Fee  ID    Name
A   AIOT  1000   1     Ali
B    CNC  1000   2   Hamza
C     AI  1200   3  Junaid
D   AIOT  2000   4    Asif
E    CNC  1500   5     Ali
F     AI  2000   6  Kashif

In [15]:
df1 = pd.DataFrame(d1)
df1

  Course   Fee  ID    Name
0   AIOT  1000   1     Ali
1    CNC  1000   2   Hamza
2     AI  1200   3  Junaid
3   AIOT  2000   4    Asif
4    CNC  1500   5     Ali
5     AI  2000   6  Kashif

# NumPy structured/record

In [16]:
df1 = pd.DataFrame(
    np.random.randint(1,100, size=(100,5)),
    columns = ['A','B','C','D','E']
)
df1.head(2)

    A   B   C   D   E
0  91  66  27  79  69
1  20  10  11  36  71

# Dictionary of Series

In [17]:
d1 = {"A":pd.Series([1,2,3]),
     "B":pd.Series([3,3,5])}
pd.DataFrame(d1)

   A  B
0  1  3
1  2  3
2  3  5

# Dictionary of Dictionary

In [18]:
d1 = {"A":{0:1,1:2, 2:3},
     "B":{0:1,1:2, 2:3},
     "C":{0:1,1:2, 2:3}}
pd.DataFrame(d1)

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

# list of Dictionary

In [19]:
l1 = [{"A":1,"B":2},
     {"A":1,"B":2},
     {"A":1,"B":2}]
pd.DataFrame(l1)

   A  B
0  1  2
1  1  2
2  1  2

In [20]:
d1 = {"ID": [1,2,3,4,5,6],
     "Name":['Ali',"Hamza","Junaid","Asif",'Ali',"Kashif"],
     'Course':['AIOT',"CNC","AI",'AIOT',"CNC","AI"],
     'Fee':[1000,1000,1200, 2000,1500,2000]}
df1 = pd.DataFrame(d1)
df1

  Course   Fee  ID    Name
0   AIOT  1000   1     Ali
1    CNC  1000   2   Hamza
2     AI  1200   3  Junaid
3   AIOT  2000   4    Asif
4    CNC  1500   5     Ali
5     AI  2000   6  Kashif

# Get General Infromation from your DataFrame

In [21]:
d1 = {"ID": [1,2,3,4,5,6],
     "Name":['Ali',"Hamza","Junaid","Asif",'Ali',"Kashif"],
     'Course':['AIOT',"CNC",np.nan,'AIOT',"CNC","AI"],
     'Fee':[1000,1000,1200, 2000,1500,2000]}
df1 = pd.DataFrame(d1)
df1

  Course   Fee  ID    Name
0   AIOT  1000   1     Ali
1    CNC  1000   2   Hamza
2    NaN  1200   3  Junaid
3   AIOT  2000   4    Asif
4    CNC  1500   5     Ali
5     AI  2000   6  Kashif

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Course    5 non-null object
Fee       6 non-null int64
ID        6 non-null int64
Name      6 non-null object
dtypes: int64(2), object(2)
memory usage: 272.0+ bytes

In [23]:
df1.describe()

               Fee        ID
count     6.000000  6.000000
mean   1450.000000  3.500000
std     463.680925  1.870829
min    1000.000000  1.000000
25%    1050.000000  2.250000
50%    1350.000000  3.500000
75%    1875.000000  4.750000
max    2000.000000  6.000000

#dataframe.info() #dataframe.describe() #dataframe.dtypes #dataframe.columns #dataframe.index #dataframe.values #dataframe.isnull() #dataframe.isnull().sum() #dataframe.notnull() #dataframe.notnull().sum() #dataframe.head(n=5) #dataframe.tail() #dataframe.apply() # pass user define function

In [24]:
df1.count()

Course    5
Fee       6
ID        6
Name      6
dtype: int64

In [25]:
df1.isnull()

  Course    Fee     ID   Name
0  False  False  False  False
1  False  False  False  False
2   True  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [26]:
df1.isnull().sum()

Course    1
Fee       0
ID        0
Name      0
dtype: int64

In [27]:
df1.notnull().sum()

Course    5
Fee       6
ID        6
Name      6
dtype: int64

In [28]:
len(df1)

6

In [29]:
df1.head(2)

  Course   Fee  ID   Name
0   AIOT  1000   1    Ali
1    CNC  1000   2  Hamza

In [30]:
df1.tail(2)

  Course   Fee  ID    Name
4    CNC  1500   5     Ali
5     AI  2000   6  Kashif

In [31]:
df1.sum(axis=0)[['ID',"Fee"]]

ID       21
Fee    8700
dtype: int64

In [33]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [34]:
df1.values

array([['AIOT', 1000, 1, 'Ali'],
       ['CNC', 1000, 2, 'Hamza'],
       [nan, 1200, 3, 'Junaid'],
       ['AIOT', 2000, 4, 'Asif'],
       ['CNC', 1500, 5, 'Ali'],
       ['AI', 2000, 6, 'Kashif']], dtype=object)

In [35]:
df1[df1.ID<=2.250000]

  Course   Fee  ID   Name
0   AIOT  1000   1    Ali
1    CNC  1000   2  Hamza

In [40]:
df1

  Course   Fee  ID    Name
0   AIOT  1000   1     Ali
1    CNC  1000   2   Hamza
2    NaN  1200   3  Junaid
3   AIOT  2000   4    Asif
4    CNC  1500   5     Ali
5     AI  2000   6  Kashif

In [41]:
#Extract Series from Dataframe
# dataframe.columnName
# dataframe['columName'] (if sapace between in column name)
df1['Course']

0    AIOT
1     CNC
2     NaN
3    AIOT
4     CNC
5      AI
Name: Course, dtype: object

In [42]:
df1.updated fee # without square bracket we can't access column those have space b/w in column name

SyntaxError: invalid syntax (<ipython-input-42-bb7d4e1cd6df>, line 1)

In [45]:
df1['updated fee']

0    0
1    0
2    0
3    0
4    0
5    0
Name: updated fee, dtype: int64

In [44]:
# Add New Column in Dataframe
#dataframe['NewColumnName'] (Always use [] for add new column)
df1['updated fee'] = 0
df1

  Course   Fee  ID    Name  updated fee
0   AIOT  1000   1     Ali            0
1    CNC  1000   2   Hamza            0
2    NaN  1200   3  Junaid            0
3   AIOT  2000   4    Asif            0
4    CNC  1500   5     Ali            0
5     AI  2000   6  Kashif            0

In [46]:
df1.Timing = 700
df1

  Course   Fee  ID    Name  updated fee
0   AIOT  1000   1     Ali            0
1    CNC  1000   2   Hamza            0
2    NaN  1200   3  Junaid            0
3   AIOT  2000   4    Asif            0
4    CNC  1500   5     Ali            0
5     AI  2000   6  Kashif            0

# Apply General Function on Series

In [48]:
#dataframe.column.apply() (pass user define function)
#dataframe.column.unique()
#dataframe.column.map() (pass dictionary (find key and replace with value))
#dataframe.column.value_counts()
#dataframe.columns.sum() #min,max,mean,std

In [49]:
df1

  Course   Fee  ID    Name  updated fee
0   AIOT  1000   1     Ali            0
1    CNC  1000   2   Hamza            0
2    NaN  1200   3  Junaid            0
3   AIOT  2000   4    Asif            0
4    CNC  1500   5     Ali            0
5     AI  2000   6  Kashif            0

In [50]:
d1 = {
    "AIOT": 1,
    "CNC":2,
    "AI":3,
    np.nan: 0
}

df1.Course.map(d1)

0    1
1    2
2    0
3    1
4    2
5    3
Name: Course, dtype: int64

In [51]:
df1['update course'] = df1.Course.map(d1)
df1

  Course   Fee  ID    Name  updated fee  update course
0   AIOT  1000   1     Ali            0              1
1    CNC  1000   2   Hamza            0              2
2    NaN  1200   3  Junaid            0              0
3   AIOT  2000   4    Asif            0              1
4    CNC  1500   5     Ali            0              2
5     AI  2000   6  Kashif            0              3

In [52]:

d2 = {}
for i , v in enumerate(df1.Course.unique()):
    d2[v] = i
d2

{'AIOT': 0, 'CNC': 1, nan: 2, 'AI': 3}

In [53]:
df1.Course.map(d2)

0    0
1    1
2    2
3    0
4    1
5    3
Name: Course, dtype: int64

In [54]:
df1.Course.unique()

array(['AIOT', 'CNC', nan, 'AI'], dtype=object)

In [55]:
for v in df1.Course.unique():
    print(v, len(df1[df1.Course == v ]))

AIOT 2
CNC 2
nan 0
AI 1

In [56]:
df1.Course.value_counts()

CNC     2
AIOT    2
AI      1
Name: Course, dtype: int64

In [57]:
df1.Fee.sum()

8700

# APPLY FUNCTION

In [58]:
df1

  Course   Fee  ID    Name  updated fee  update course
0   AIOT  1000   1     Ali            0              1
1    CNC  1000   2   Hamza            0              2
2    NaN  1200   3  Junaid            0              0
3   AIOT  2000   4    Asif            0              1
4    CNC  1500   5     Ali            0              2
5     AI  2000   6  Kashif            0              3

In [59]:
def f1(x):
    if x == 'AIOT':
        return 2000
    elif x=="AI":
        return 1200
    elif x=='CNC':
        return 1500
    else:
        return 0
    
df1.Course.apply(f1)

0    2000
1    1500
2       0
3    2000
4    1500
5    1200
Name: Course, dtype: int64

In [60]:
df1['updated fee'] = df1.Course.apply(f1)
df1

  Course   Fee  ID    Name  updated fee  update course
0   AIOT  1000   1     Ali         2000              1
1    CNC  1000   2   Hamza         1500              2
2    NaN  1200   3  Junaid            0              0
3   AIOT  2000   4    Asif         2000              1
4    CNC  1500   5     Ali         1500              2
5     AI  2000   6  Kashif         1200              3

In [61]:
df2 = pd.DataFrame(np.random.randint(1,100,size=(6,5)), columns=['A',"B","C","D","E"])
df2

    A   B   C   D   E
0  47  89  55  91  67
1   1  94  60  88  35
2  81  92  67  47  21
3  99  12  19  35  88
4  61  79  38   6  40
5  20  18   6  70  35